Revit 2026 API

# MassSurfaceDataIsConceptualConstructionByEnergyData Property

---

True when the ConceptualConstructionType id is synchronized to the EnergyDataSettings. False when the ConceptualConstructionType id is overridden for this MassSurfaceData.

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsConceptualConstructionByEnergyData { get; set; }
```
```vb
Public Property IsConceptualConstructionByEnergyData As Boolean
	Get
	Set
```
```cpp
public:
property bool IsConceptualConstructionByEnergyData {
	bool get ();
	void set (bool value);
}
```
```fsharp
member IsConceptualConstructionByEnergyData : bool with get, set
```

#### Property Value

Boolean

| Exception | Condition |
| --- | --- |
| ArgumentException | When setting this property: ConceptualConstructionIsByEnergyData cannot be set to conceptualConstructionIsByEnergyData. |

#### Reference

MassSurfaceData Class

Autodesk.Revit.DB.Analysis Namespace